Repo/tITP/tITP_comparison/0/ampholyte.HISTIDINE
/*--------------------------------*- C++ -*----------------------------------*\ 
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  v3.0+                                 |
|   \  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
 FoamFile{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      ampholyte.HISTIDINE;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

 dimensions      [0 -3 0 0 1 0 0];

 internalField  nonuniform List<scalar>
5000
 (
1.5522514931184863
 1.83086749164174
 2.151833962381971
 2.520088627781955
 2.9408745807342123
 3.419711617638695
 3.9623576259900055
 4.57475939730549
...
)
;

boundaryField
{
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
    wall
    {
        type            zeroGradient;
    }
    inlet
    {
        type            inletOutlet;
 inletValue           uniform 00.0;
    phi             flux;
   }
 outlet
    {
        type            inletOutlet;
 inletValue           uniform 100.0;
    phi             flux;
   }

    axis    {
        type            empty;
    }
}
