Repo/tITP/tITP_comparison/constant/ampholyteProperties
/*--------------------------------*- C++ -*----------------------------------*\ 
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  1.7.1                                 |
|   \  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * // 
 ampholytes
 ( 
MES 
 {
 diffusivity diffusivity [0 2 -1 0 0 0 0 ] 7.238182100844691e-10; 
 mobility 6(0.0 0.0 0.0 2.8000000000000003e-08 0.0 0.0); 
 pk 6(1000000.0 100000.0 10000.0 0.0008035261221856177 1e-13 1e-14);
 K1 4(0.0 0.0 0.0 0.0);
 K2 16(0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0);
}
HISTIDINE 
 {
 diffusivity diffusivity [0 2 -1 0 0 0 0 ] 1.2279058921075814e-09; 
 mobility 6(0.0 4.75e-08 2.6800000000000002e-08 2.8300000000000002e-08 0.0 0.0); 
 pk 6(1000000.0 9.772372209558112 0.0009120108393559096 4.677351412871981e-07 1e-13 1e-14);
 K1 4(0.0 0.0 0.0 0.0);
 K2 16(0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0);
}
ASPARTIC_ACID 
 {
 diffusivity diffusivity [0 2 -1 0 0 0 0 ] 1.4295409649168264e-09; 
 mobility 6(0.0 0.0 3.06e-08 3.0100000000000005e-08 5.53e-08 0.0); 
 pk 6(1000000.0 100000.0 12.589254117941675 0.12589254117941676 1e-07 1e-14);
 K1 4(0.0 0.0 0.0 0.0);
 K2 16(0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0);
}
GLUTAMIC_ACID 
 {
 diffusivity diffusivity [0 2 -1 0 0 0 0 ] 1.4036903145566668e-09; 
 mobility 6(0.0 0.0 2.8700000000000002e-08 2.7e-08 5.43e-08 0.0); 
 pk 6(1000000.0 100000.0 7.244359600749899 0.04742419852602448 1.0964781961431829e-07 1e-14);
 K1 4(0.0 0.0 0.0 0.0);
 K2 16(0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0);
}
    );
/***************paper parameters*******************/
 sigma_0 sigma_0 [-1 -3 2 0 1 1 0] 0;
 phip            phip [ 0 0 0 0 0 0 0 ] 1;
 taup            taup [ 0 0 0 0 0 0 0 ] 1;
 sc             sc [ 0 1 0 0 0 0 0 ] 0;
 se             se [ 0 1 0 0 0 0 0 ] 0;
 Kperm          Kperm   [ 0 2 0 0 0 0 0 ] 1;
 zeta           zeta [1 2 -3 0 0 -1 0] -0.0;
 rho_fluid rho_fluid  [1 -3 0 0 0 0 0] 1000.0;
/**************************************************************************/ 
